[
  {
    "bookId": "1",
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://m.media-amazon.com/images/I/71aFt4+OTOL._SL1500_.jpg",
    "review": "The Alchemist is an inspiring philosophical journey that follows a young shepherd named Santiago. Through his adventures, he learns to follow his dreams and listen to his heart. The story beautifully explores themes of destiny, personal legend, and the pursuit of happiness. Paulo Coelho’s writing is simple yet profound, offering deep life lessons. It is a timeless book that encourages readers to find their own path in life.",
    "totalPages": 208,
    "rating": 4.7,
    "category": "Adventure",
    "tags": ["Philosophical", "Spiritual", "Quest"],
    "publisher": "HarperOne",
    "yearOfPublishing": 1988
  },
  {
    "bookId": "2",
    "bookName": "Educated",
    "author": "Tara Westover",
    "image": "https://m.media-amazon.com/images/I/81WojUxbbFL._SL1500_.jpg",
    "review": "Educated by Tara Westover is a powerful memoir that delves into the author's journey from a secluded, survivalist upbringing to earning a Ph.D. at Cambridge. The narrative is a testament to resilience, shedding light on the struggles of breaking free from familial and cultural constraints. Westover's eloquent storytelling captures the profound impact of education in shaping identity and forging new paths.",
    "totalPages": 352,
    "rating": 4.8,
    "category": "Memoir",
    "tags": ["Inspiring", "Non-fiction", "Biography"],
    "publisher": "Random House",
    "yearOfPublishing": 2018
  },
  {
    "bookId": "3",
    "bookName": "The Midnight Library",
    "author": "Matt Haig",
    "image": "https://m.media-amazon.com/images/I/81WcnNQ-TBL._SL1500_.jpg",
    "review": "The Midnight Library by Matt Haig is a poignant exploration of life's possibilities and the impact of our decisions. The story follows Nora, who discovers a magical library where she can experience alternate versions of her life, offering profound insights into regret, happiness, and self-acceptance. With its heartfelt narrative and relatable themes, this novel inspires readers to embrace their choices and find meaning in their journey.",
    "totalPages": 304,
    "rating": 4.2,
    "category": "Fantasy",
    "tags": ["Philosophical", "Fantasy", "Self-help"],
    "publisher": "Viking",
    "yearOfPublishing": 2020
  },
  {
    "bookId": "4",
    "bookName": "Atomic Habits",
    "author": "James Clear",
    "image": "https://m.media-amazon.com/images/I/91bYsX41DVL._SL1500_.jpg",
    "review": "Atomic Habits by James Clear is a transformative guide that provides practical and scientifically grounded strategies for building good habits and eliminating bad ones. The book emphasizes the power of small, consistent changes and how they compound over time to create remarkable results. With clear examples and actionable steps, it serves as an invaluable resource for anyone looking to improve their daily routines and achieve long-term success.",
    "totalPages": 320,
    "rating": 4.7,
    "category": "Self-help",
    "tags": ["Motivational", "Non-fiction", "Productivity"],
    "publisher": "Avery",
    "yearOfPublishing": 2018
  },
  {
    "bookId": "5",
    "bookName": "Where the Crawdads Sing",
    "author": "Delia Owens",
    "image": "https://i.ibb.co.com/P90D2QY/henry-be-lc7xc-Web-ECc-unsplash.jpg",
    "review": "Where the Crawdads Sing by Delia Owens is a beautifully crafted novel that intertwines an enthralling mystery with vivid descriptions of North Carolina's wild landscapes. The story masterfully explores themes of loneliness, resilience, and the human connection to nature. With its lyrical prose and compelling narrative, it leaves readers deeply moved and reflecting on the intricate relationships between people and their surroundings.",
    "totalPages": 368,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Mystery", "Nature", "Romance"],
    "publisher": "Putnam",
    "yearOfPublishing": 2018
  },
  {
    "bookId": "6",
    "bookName": "Becoming",
    "author": "Michelle Obama",
    "image": "https://m.media-amazon.com/images/I/81h2gWPTYJL._SL1500_.jpg",
    "review": "Becoming by Michelle Obama is a deeply personal and inspiring memoir that offers a vivid glimpse into her life, from her humble beginnings to her time as First Lady of the United States. With heartfelt honesty, she shares her challenges, triumphs, and the values that shaped her journey. This compelling narrative encourages readers to reflect on their own stories and aspirations.",
    "totalPages": 448,
    "rating": 4.9,
    "category": "Biography",
    "tags": ["Inspirational", "Non-fiction", "Empowerment"],
    "publisher": "Crown Publishing Group",
    "yearOfPublishing": 2018
  }
]
